app/views/users/show.html.erb

            <% currentday = Date.today.strftime("%A") %>
            <% x = TimetableEntry.where(['timetable_id = ? and day = ?', @user.timetable_id, currentday]) %>
---
SELECT "timetable_entries".* FROM "timetable_entries" WHERE (timetable_id = 13 and day = 'Tuesday')