app/views/courses/_form.html.erb

SELECT "users".* FROM "users"
---
<% userstestarray = "[" %>
<% User.all.each do |u| %>