app/controllers/application_controller.rb

SELECT COUNT(*) FROM "users"
---
	def install_ok
		if User.count <= 0