app/controllers/courses_controller.rb

SELECT  "courses".* FROM "courses" WHERE "courses"."title" = ? LIMIT 1
---
  def html
    @course = Course.find_by(title: params[:title])

INSERT INTO "courses" ("title", "teacher_id", "description", "html", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    params[:course][:title] = params[:course][:title].gsub(/\s+/, "-").downcase
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save