app/controllers/timetables_controller.rb

    def set_timetable
      @timetable = Timetable.find(params[:id])
---
SELECT  "timetables".* FROM "timetables" WHERE "timetables"."id" = ? LIMIT 1