app/models/course.rb

	def teacher
		x = User.where(['id = ?', self.teacher_id])
		if x.blank?
---
SELECT "users".* FROM "users" WHERE (id = 35)