app/models/group.rb

	def leader
		x = User.where(['id = ?', self.leader_id])
		if x.blank?
---
SELECT "users".* FROM "users" WHERE (id = 35)