app/models/timetable.rb

SELECT "timetable_entries".* FROM "timetable_entries" WHERE (timetable_id = 12 and start = '08:00' and day = 'Monday')
---
	def table(time,day)
			dayname = day.strftime("%A")
			x = ::TimetableEntry.where(['timetable_id = ? and start = ? and day = ?', self.id, time, dayname])
			if x.blank?

SELECT "timetable_entries".* FROM "timetable_entries" WHERE (day = 'Tuesday' and timetable_id = 12)
SELECT COUNT(*) FROM "timetable_entries" WHERE (day = 'Tuesday' and timetable_id = 12)
---
	def hours_today
		t = TimetableEntry.where(['day = ? and timetable_id = ?', Date.today.strftime("%A"), self.id])
		if t.blank?
			return 0
		else
			return t.count

SELECT COUNT(*) FROM "timetable_entries" WHERE "timetable_entries"."timetable_id" = ?
---
	def weekly_hours
		return TimetableEntry.where(:timetable_id => self.id).count