app/models/user.rb

  	def timetable_id
  		Timetable.where(['user_id = ?', self.id]).each do |t|
---
SELECT "timetables".* FROM "timetables" WHERE (user_id = 36)

	def level
		self.group.each do |x|
---
SELECT "groups".* FROM "groups" WHERE (id = 1)

	def employer
		return Group.find_by(id: self.role).leader
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1