app/views/layouts/_admin_lte_2_sidebar.html.erb

      <li class="treeview">
        <a href="#"><i class='fa fa-link'></i> <span>Groups (<%= Group.count %>)</span> <i class="fa fa-angle-left pull-right"></i></a>
        <ul class="treeview-menu">
          <% Group.all.each do |g| %>
---
SELECT COUNT(*) FROM "groups"
SELECT "groups".* FROM "groups"

      </li>
      <li><%= nav_link("/timetables/"+Timetable.find_by(user_id: current_user.id).id.to_s,"calendar","Timetable") %></li>
---
SELECT  "timetables".* FROM "timetables" WHERE "timetables"."user_id" = ? LIMIT 1