app/views/layouts/_admin_lte_2_header.html.erb

            <% m = Message.where(['recipent_id = ?', current_user.id]) %>
            <li class="header">You have <%= Message.where(['recipent_id = ?', current_user.id]).count %> message<% if m.count != 1 %>s<% end %>.</li>
---
SELECT COUNT(*) FROM "messages" WHERE (recipent_id = 35)