app/views/layouts/admin_lte_2.html.erb

                    Courses
                    <span class="label label-danger pull-right"><%= Course.all.count %>/200</span>
---
SELECT COUNT(*) FROM "courses"

                    Notes
                    <span class="label label-danger pull-right"><%= Note.count %></span>
---
SELECT COUNT(*) FROM "notes"