app/views/layouts/frontend.html.erb

SELECT "courses".* FROM "courses"
---
          <div class="navigation-bar__dropdown-container">
            <% Course.all.each do |c| %>